[
  {
    "id": 646512,
    "title": "Salmon Caesar Salad",
    "ingredients": [
      "light caesar dressing",
      "lemon juice",
      "olive oil",
      "paprika",
      "shredded parmesan cheese",
      "black pepper",
      "romaine",
      "salmon fillet",
      "salt",
      "slivered almonds"
    ],
    "steps": [
      "Heat up a skillet/frying pan and sir the Salmon in the coconut oil/olive oil (don't forget to add the salt and paprika to it) until very lightly browned on each side (i like my salmon slightly undercooked-its up to you if you want it more done). Top with freshly squeezed lemon juice and let it sit in the frying pan for about 1 minute. In a Large bowl, mix the romaine lettuce with the Caesar salad dressing and dump it out into a large plate, top off with Asiago/Parmesan cheese and you can also sprinkle the toasted almonds on now.",
      "Place the Salmon (sliced) on top. You can sprinkle it with some more fresh lemon juice:) and black pepper!"
    ],
    "image": "Healthy-Salmon-Caesar-Salad-646512.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/36WZD7DS/healthy-salmon-caesar-salad-recipe"
  },
  {
    "id": 716427,
    "title": "Roasted Butterflied Chicken w. Onions & Carrots",
    "ingredients": [
      "carrots",
      "chicken",
      "ghee",
      "ghee",
      "dried herbes de provence",
      "bell pepper",
      "red onions",
      "sea salt"
    ],
    "steps": [],
    "image": "roasted-butterflied-chicken-w-onions-carrots-716427.jpg",
    "sourceUrl": "http://fullbellysisters.blogspot.com/2014/04/roasted-butterflied-chicken-w-onions.html"
  },
  {
    "id": 656752,
    "title": "Pork Chops with Garlic Cream",
    "ingredients": [
      "butter",
      "buttermilk",
      "dry white wine",
      "fresh thyme",
      "heavy cream",
      "bell pepper",
      "pork chops",
      "salt",
      "shallot",
      "vegetable oil",
      "whole garlic cloves"
    ],
    "steps": [
      "In a small sauce pan melt the butter over medium-low heat and cook the shallots until softened, about 5 minutes.",
      "Add the wine, thyme and a generous  teaspoon salt. Raise the heat to medium and simmer until the liquid is reduced to 2 tablespoons. Stir in the heavy cream and the buttermilk and all the garlic cloves.Return to a bare simmer and cook, stirring occasionally, until the garlic is completely tender, 40 to 45 minutes.",
      "Transfer the garlic mixture to a blender and puree until very smooth, about 1 minute. Return the garlic sauce to the saucepan. It should be thick enough to cover the back of a wooden spoon but easy to pour. Set aside covered to keep warm.Preheat oven to 375.Salt and pepper generously the pork chops. In a large skillet over medium high heat add the oil. When hot add the chops and sear them on each side. 2minutes each sides.",
      "Remove from the stove and place in the hot oven. Cook for 3 minutes at 375 then lower the heat to 300 for another 5 minutes. The chops need to be springy to the touch and golden brown on the outside."
    ],
    "image": "Pork-Chops-with-Garlic-Cream-656752.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/MMSZLRHM/pork-chops-with-garlic-cream"
  },
  {
    "id": 649248,
    "title": "Lamb Tagine Stew",
    "ingredients": [
      "black pepper",
      "carrot",
      "cinnamon",
      "green peas",
      "lemon (juice)",
      "lamb",
      "lamb stock",
      "mushroom",
      "olive oil",
      "onion",
      "oregano",
      "parsley",
      "salt"
    ],
    "steps": [
      "Saute lamb chops in 2 teaspoons of olive oil.",
      "Place 2 teaspoons of olive oil in a wok and add onions, carrots, salt and pepper, oregano and stock.",
      "Add lamb, mushrooms and peas.In a separate bowl, mix parsley, lemon juice and cinnamon.",
      "Add this mixture to the wok.",
      "Serve with couscous."
    ],
    "image": "Lamb-Tagine-Stew-649248.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/W5XY7PWG/lamb-tagine-stew"
  },
  {
    "id": 1095689,
    "title": "Garlic Oregano Olive Tapenade [Paleo, AIP, Keto]",
    "ingredients": [
      "olives",
      "fresh oregano leaves",
      "garlic",
      "extra virgin olive oil",
      "zucchini",
      "canned sardines"
    ],
    "steps": [
      "Place all the ingredients into a blender and blend really well.",
      "To serve, shred the zucchini and divide between two bowls. Top with the tapenade and sardines."
    ],
    "image": "garlic-oregano-olive-tapenade-paleo-aip-keto-1095689.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/P47LT3HY/garlic-oregano-olive-tapenade-recipe-paleo-aip-keto"
  },
  {
    "id": 650377,
    "title": "Low Carb Brunch Burger",
    "ingredients": [
      "avocado",
      "bacon",
      "cumin",
      "eggs",
      "garlic powder",
      "ground beef",
      "onion powder",
      "bell pepper",
      "salt",
      "sharp cheddar",
      "tabasco sauce",
      "worcestershire sauce"
    ],
    "steps": [
      "Fry up 4 strips of bacon and set aside.Leave some of the bacon fat in the pan but remove from the eye.Put all of the spices and sauces into the ground beef, mix well and form even patties.",
      "Heat a large non-stick skillet until the pan (with some of the bacon fat in it) is hot.",
      "Place patties in hot pan and sear for 1 minute and 30 seconds each side. After searing the burgers, remove them from stove top and bake off in the oven at 415 degrees until it reaches your desired temperature (3-4 minutes).While the burgers are in the oven, get your egg going. On the same hot eye where you did your burger, use a new non-stick pan for the eggs. On the two over easy eggs, grind 2 grinds of salt, 2 grinds of pepper and a dash of Tabasco onto each egg yolk.",
      "Add the cheese on the burgers when the burgers have about 1 minute of cook time remaining, so the cheese melts."
    ],
    "image": "Low-Carb-Brunch-Burger-650377.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/5SPTY657/low-carb-brunch-burger"
  },
  {
    "id": 639306,
    "title": "Simple Poached Egg Dinner",
    "ingredients": [
      "fresh baby spinach",
      "bacon",
      "eggs",
      "olive oil",
      "sweet onion",
      "Salt & Pepper",
      "vinegar"
    ],
    "steps": [
      "Add bacon to onions and saut for about 10 minutes or until the onions are translucent and the bacon is almost cooked.While bacon and onions are cooking bring about 3 inches of water to a boil and add the vinegar. Once boiling reduce heat to just barely simmer.",
      "Add the spinach and turn with tongs until completely wilted and mixed with the bacon and onions.",
      "Saute for 2  minutes; just until spinach is cooked.  Do not overcook!Give the water a gentle stir and just after you add the spinach to the onions and bacon,  drop the eggs in one at a time to poach. (first break the eggs into a cup) 3 minutes will give you medium firm egg; runny yolk and solid whites.Divide the spinach evenly between two dinner plates and top with two poached eggs.",
      "Sprinkle black lava salt (if you have another kind of salt like truffle salt, that is great too!) and fresh ground black pepper.",
      "Serve with a large chunk of toasted baguette."
    ],
    "image": "Choice-Eggs-639306.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/KBGV6PWC/choice-eggs"
  },
  {
    "id": 643428,
    "title": "Fresh and Simple Swai Ceviche",
    "ingredients": [
      "diced avocado",
      "chile paste",
      "cilantro",
      "diced cod fillets",
      "lime (juice)",
      "olive oil",
      "salt and pepper",
      "red diced shallot",
      "tomato"
    ],
    "steps": [
      "Place the diced fish into  of the lime juice and refrigerate for at least 3 hours. Strain when ready to proceed.",
      "Mix the veggies with the remaining lime juice.Stir in the fish and cilantro.",
      "Drizzle with olive oil and add the chile-garlic sauce. Gently toss.Salt and pepper to taste.",
      "Serve with tortilla chips or a salad."
    ],
    "image": "Fresh-and-Simple-Swai-Ceviche-643428.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/YN4MPXC7/fresh-and-simple-swai-ceviche"
  },
  {
    "id": 661948,
    "title": "Strip steak with roasted cherry tomatoes and vegetable mash",
    "ingredients": [
      "balsamic vinegar",
      "beef strip loin",
      "cherry tomatoes",
      "fresh chives",
      "fresh green beans",
      "fresh peas",
      "fresh rosemary",
      "garlic",
      "olive oil",
      "pepper",
      "ricotta cheese",
      "salt",
      "unsalted butter"
    ],
    "steps": [
      "For the marinade, mix the first 5 ingredients, add fresh rosemary.",
      "Pour marinade over steaks and allow to stand for at least an hour, preferably overnight.Cook cherry tomatoes in a grill pan, drizzle over a little olive oil and season to taste. Set aside.",
      "Remove the steaks from the marinade and cook for 2 minutes on each side in hot olive oil.  Reduce the heat, add butter and cook for another 2-4 minutes, turning once, depending on how rare you like your meat.",
      "Transfer to a plate, set aside in a warm place to rest.To make the mash, cook green string beans and peas in boiling water for 8-10 minutes until tender, then drain and cool under cold water.Tip them into a food processor with the ricotta and a tablespoon of olive oil. Season with salt and pepper, blend them to a rough pure.",
      "Transfer the mash to a pan where the stakes were cooked and gently heat it for 1 minute.To serve, divide the pure among warmed plates and arrange the steaks on top. Finish with a pile of roasted tomatoes, a drizzle of olive oil and some steamed new potatoes."
    ],
    "image": "Striploin-steak-with-roasted-cherry-tomatoes-and-vegetable-mash-661948.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/BS5TFNHL/striploin-steak-with-roasted-cherry-tomatoes-and-vegetable-mash"
  },
  {
    "id": 664054,
    "title": "Turkey Sausage, Chard & Sweet Potato Breakfast Scramble",
    "ingredients": [
      "baby bella mushrooms",
      "breakfast sausage",
      "chard",
      "eggs",
      "green onion",
      "olive oil",
      "sweet potato",
      "water"
    ],
    "steps": [
      "In a medium-sized skillet, heat about two teaspoons of olive oil on medium heat.",
      "Add the chopped sweet potato and saut 3 or 4 minutes before adding a little liquid and covering. In about 2 minutes, check to see if the liquid has burned off. If it has, add a little more and cover again. Repeat this several times until the sweet potato is soften, but still al dente.",
      "Add the mushrooms and the chopped chard stems. Saut another 3 to 5 minutes and add additional liquid if necessary.Move the veggies to one side of the skillet with a wooden spoon and add the ground breakfast sausage. Brown the meat and using the wooden spoon break it apart. Continue sauting until the sausage is cooked all the way through.Immediately add the green onion and chard leaves. Allow to steam for about 30 seconds before pouring the scrambled egg mixture evenly over the meat and veggies. This is where the technique comes in. Avoid the temptation to stir. Simply allow the skillet to sit 2 to three minutes. Then, using a wooden spoon or spatula, begin flipping sections of egg and veggies (similar to how you would fold whipped egg whites into a cake batter, just gently fold the scramble onto itself). Once all sections have been flipped over, everything to sit and cook another 2 or 3 minutes. Repeat the flipping.  Continue doing this until the egg is no longer cooking to the skillet.",
      "Serve with your favorite toppings!"
    ],
    "image": "Turkey-Sausage--Chard---Sweet-Potato-Breakfast-Scramble-664054.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/S3LTQRHW/turkey-sausage-chard-sweet-potato-breakfast-scramble"
  },
  {
    "id": 471242,
    "title": "Entrecote Steak with Asparagus",
    "ingredients": [
      "green asparagus",
      "beef tenderloin",
      "butter",
      "coconut oil",
      "garlic",
      "kosher salt",
      "olive oil",
      "onions",
      "bell pepper"
    ],
    "steps": [
      "Take the steaks out of the fridge 45 minutes before frying them.Dry the meat with paper towels.Rub kosher salt and pepper with the olive oil into the steaks, let them sit and get to room temperature.",
      "Cut the asparagus and fry in a pan for about 10 minutes under medium heat. Salt and pepper the asparagus.",
      "Heat up a cast iron pan under high heat and put in the coconut oil (it has a higher smoking point than olive oil). Make sure the pan is smoking hot.Fry the onions (cut into rings) and take them out again.Put in the steaks and fry them for about 2-3 minutes on each side, flipping them every 60 seconds for even heat distribution.When the steaks are almost done, reduce heat to medium, throw in roughly chopped garlic and the butter.Stir butter and garlic in the pan and scoop the buttery garlic goodness over the steaks a couple of times.When done, take the steaks out and let them sit for 3 minutes next to the served asparagus (juices need to settle). If you can't take it anymore to look at your perfect steak, eat up!"
    ],
    "image": "Entrecote-Steak-with-Asparagus-471242.jpg",
    "sourceUrl": "http://spoonacular.com/-1397171023262"
  },
  {
    "id": 643150,
    "title": "Fluffy frittata with spinach",
    "ingredients": [
      "eggs",
      "garlic",
      "ground pepper",
      "nutmeg",
      "olive oil",
      "parmesan",
      "ricotta cheese",
      "salt",
      "fresh spinach",
      "dry frozen spinach"
    ],
    "steps": [
      "In a medium oven-proof skillet heat the olive oil, add the garlic and cook until softened.In a glass or metal bowl, beat the egg whites until stiff peaks form. In another bowl, beat the egg yolks and stir in the spinach and ricotta cheese; season with the salt, pepper and nutmeg. Fold in the egg whites.",
      "Pour the mixture into the hot skillet and cook over medium heat until just set around the edges, about 2 minutes.",
      "Transfer the frittata to the oven and bake at 200C until golden and fluffy, about 15 minutes.",
      "Sprinkle the parmesan all over the top and bake for 2 minutes.",
      "Cut into wedges and serve immediately."
    ],
    "image": "Fluffy-frittata-with-spinach-643150.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/Z3SVPNCV/fluffy-frittata-with-spinach"
  },
  {
    "id": 640349,
    "title": "Cranberry and Orange Juice Spareribs",
    "ingredients": [
      "black pepper",
      "cranberry juice",
      "curry powder",
      "garlic powder",
      "ground cumin",
      "ketchup",
      "orange juice",
      "salt",
      "soy sauce",
      "spare ribs",
      "vinegar",
      "water"
    ],
    "steps": [
      "Combine all of the ingredients for the marinade in a bowl and stir.",
      "Place ribs in the marinade and refrigerate for at least one hour or more or up to overnight.Preheat oven to 325 degrees F.",
      "Place the ribs in a roasting pan with the marinade.",
      "Bake uncovered for 2 – 2 ½ hours or until the ribs are fall off the bone tender. Allow the marinade to evaporate in the cooking process.",
      "Let the ribs cool slightly; then separate the ribs with a cooking scissor and plate."
    ],
    "image": "Cranberry-and-Orange-Juice-Spareribs-640349.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/KND4S2Q4/cranberry-and-orange-juice-spareribs"
  },
  {
    "id": 716296,
    "title": "Peri Peri Chicken and Savoury Rice",
    "ingredients": [
      "bell pepper",
      "bird's eye chilli pepper",
      "black pepper",
      "chicken pieces",
      "red chilli powder",
      "garlic",
      "ginger",
      "ice cube",
      "lemon",
      "onion",
      "oregano",
      "paprika",
      "red food colouring",
      "salt",
      "scotch bonnet pepper",
      "vegetable oil",
      "dark vinegar"
    ],
    "steps": [
      "Wash the Chicken and set aside.Blend all the Ingredients together and pour as needed on the chicken. Rub it into the chicken and allow to marinate for about 3-5 hours.If you have a grill, heat up the grill and and place chicken on to cook. If you don’t and you are using an oven, set the oven to grill/broil at first and let the chicken brown on both sides then reset the oven to bake at 370 F and bake the chicken till cooked.If there is left over sauce from the blend, heat it up with a little water and serve with the peri peri chicken. Savoury Rice",
      "Ingredients2 cups of Rice1/2 bulb of Onion1/4 pound of Cabbage1 cup of chopped carrots1 egg1 cup of melted butter",
      "Chicken Seasoning1 teaspoon of currya pinch of thyme Wash and Parboil the Rice for 10 minutes.",
      "Heat the butter in a pot and pour in the chopped onions, carrots and cabbage and stir in.Break the egg into the veggie mix and stir in.",
      "Add your seasoning and pour in the parboiled rice.",
      "Pour in 1 cup of water and cook on medium heat till the rice is soft. Stir and serve with the chicken."
    ],
    "image": "peri-peri-chicken-and-savoury-rice-716296.jpg",
    "sourceUrl": "http://www.afrolems.com/2013/07/30/peri-peri-chicken-savoury-rice/"
  },
  {
    "id": 638071,
    "title": "Chicken En Papillote With Basil and Cherry Tomatoes",
    "ingredients": [
      "skinless boneless chicken breast",
      "salt and pepper",
      "olive oil",
      "onion",
      "garlic clove",
      "white wine",
      "cherry tomatoes",
      "basil",
      "fresh basil"
    ],
    "steps": [
      "Preheat oven to 400 degrees.",
      "Salt and pepper chicken and place on parchment sheet.",
      "Drizzle with olive oil.",
      "Add onion, garlic, white wine, cherry tomatoes and basil. Wrap parchment tightly around contents and secure into a package with kitchen twine.",
      "Place on cookie sheet.",
      "Place in oven for 35 to 40 minutes or until thermometer inserted into chicken reads 165 degrees. Unwrap package and serve hot, with a garnish of fresh basil chiffonade."
    ],
    "image": "Chicken-En-Papillote-With-Basil-and-Cherry-Tomatoes-638071.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/GY4BZ7SZ/chicken-en-papillote-with-basil-and-cherry-tomatoes"
  },
  {
    "id": 638455,
    "title": "Chicken with White Wine Tarragon Cream Sauce",
    "ingredients": [
      "butter",
      "fresh mushrooms",
      "onion",
      "fresh garlic",
      "skinless boneless chicken breasts",
      "white wine",
      "worcestershire sauce",
      "sour cream",
      "tarragon"
    ],
    "steps": [
      "In large skillet saute onions, mushrooms, and garlic until lightly brown; add chicken breast and cook on medium high for 10 minutes or until chicken is done.",
      "Remove chicken and place on a platter.",
      "Add white wine and cook until alcohol has burned off, about 2 minutes.",
      "Add Worchestershire sauce and sour cream and stir until combined.",
      "Pour sauce over chicken, sprinkle with tarragon and serve.",
      "Excellent with biscuits, pasta or rice."
    ],
    "image": "Chicken-with-White-Wine-Tarragon-Cream-Sauce-638455.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/KTPC33HB/chicken-and-cream-sauce"
  },
  {
    "id": 654373,
    "title": "Palak Paneer",
    "ingredients": [
      "butter",
      "cheese",
      "chillies",
      "garam masala",
      "oil",
      "salt",
      "spinach",
      "tomato"
    ],
    "steps": [
      "Boil the spinach",
      "Add the ingreidnts in a pan",
      "Mix it"
    ],
    "image": "Palak-Paneer-654373.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/CTWYZBJF/palak-paneer"
  },
  {
    "id": 640984,
    "title": "Cuban Chicken Fricasse",
    "ingredients": [
      "garlic",
      "kosher salt",
      "black fresh ground pepper",
      "chicken thighs",
      "olive oil",
      "cumin",
      "sazon completa",
      "onion",
      "red bell pepper",
      "canned tomato sauce",
      "dry white wine",
      "wine",
      "water",
      "red wine vinegar",
      "green pimento stuffed olives",
      "potatoes"
    ],
    "steps": [
      "Season the chicken with sazon completa (enough to cover both sides of the chicken)and refrigerate for 1 hour.",
      "Warm the oil in a large Dutch oven over medium heat and add the onions & bell peppers.",
      "Heat until translucent, then add garlic and saute for 1 minute. (Be careful not to burn the garlic).",
      "Add all the chicken to the pan.",
      "Add the rest of the ingredients: cumin, red wine vinegar, tomato sauce, red & white wine, water, olives, and potatoes. Stir to combine all the ingredients.",
      "Reduce heat to low, cover pan and simmer for 35 minutes.",
      "Serve with white rice & spoon sauce over chicken."
    ],
    "image": "Cuban-Chicken-Fricasse-640984.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/QDQ6CXMB/cuban-chicken-fricasse"
  },
  {
    "id": 157960,
    "title": "Portobello Baked Eggs",
    "ingredients": [
      "eggs",
      "goat cheese",
      "olive oil",
      "portobello mushroom caps",
      "salt and pepper",
      "spinach"
    ],
    "steps": [
      "Turn the oven to broil. Clean mushroom caps and, if desired, lightly scrape the gills out of the underneath of each cap.",
      "Brush mushrooms on both sides with olive oil , and season with salt and pepper.",
      "Place gill side down on a sheet pan and cook for about 3-5 minutes.",
      "Remove from the oven.  Turn the oven down to 350°F.   Turn the mushrooms gill side up and start building.  First, place the spinach into the cap building up the sides and creating a well in the middle, if necessary, to accommodate the egg.",
      "Add some goat cheese and Carefully break one egg into the well of each of the mushroom caps. Now place them back into your 350°F oven and bake for 15 to 17 minutes depending on how well done or sunny-side-up you like your eggs.",
      "Serve immediately."
    ],
    "image": "Portobello-Baked-Eggs-157960.jpg",
    "sourceUrl": "http://spoonacular.com/-1389721519798"
  },
  {
    "id": 640509,
    "title": "Cream Cheese Stuffed Chicken Breasts",
    "ingredients": [
      "bacon",
      "black pepper",
      "unsalted butter",
      "cream cheese",
      "fresh tarragon",
      "garlic",
      "olive oil",
      "diced onion",
      "salt",
      "skinless boneless chicken breasts"
    ],
    "steps": [
      "Preheat the oven to 350 F.In a small skillet, sweat the onions over medium-low heat in the butter or olive oil until they are soft and translucent, about 5 minutes.",
      "Add the garlic and cook for another minute then remove from the heat and allow to cool.In another skillet, saut the bacon over low heat until soft and the fat is beginning to render out, but dont allow it to brown.",
      "Remove to a paper towel and set aside.",
      "Place the chicken breasts between two sheets of waxed paper and evenly pound to 1/4-inch thickness, either with the smooth side of a  meat mallet or a small, heavy pan.  Season on both sides with the salt and pepper.Stir the onion and garlic into the cream cheese until well blended; divide evenly between the chicken  by placing a dollop in the center of each breast.",
      "Roll or fold the chicken around the cream cheese mixture, tucking the ends under and securing with toothpicks.",
      "Sprinkle the tarragon evenly over the chicken packages, and wrap each with a piece of bacon.",
      "Place in an 8x11 baking  dish and drizzle with the melted butter.",
      "Bake for 25 to 30 minutes,  or until the chicken is done, the bacon is browned and the cream cheese is heated all the way through.",
      "Serve immediately."
    ],
    "image": "Cream-Cheese-Stuffed-Chicken-Breasts-640509.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/X5RRF6VF/cream-cheese-stuffed-chicken-breasts"
  },
  {
    "id": 650378,
    "title": "Curry Chicken Salad",
    "ingredients": [
      "canned chicken",
      "diced carrot",
      "diced celery",
      "cucumber",
      "curry powder",
      "mayonnaise",
      "red grapes",
      "salad greens",
      "turmeric powder"
    ],
    "steps": [
      "Strain the water from the cans of chicken and place the chicken in large mixing bowl.",
      "Add mayonnaise. You can use more or less based on how moist you like your chicken salad.Season with salt and pepper to taste, go easy on the seasoning at this point because the main seasoning will occur at the end when you add the spices. Drop in the diced celery, carrot, cucumber and grapes and mix well. Once all the ingredients have been combined, add additional mayonnaise if you prefer a wetter consistency to the salad.Once the consistency is right, add in curry powder and turmeric powder. These are they key ingredients, so make sure you are using high quality spices. Start with a small amount of each spice and gradually add to taste - the measurements here are just recommendations, you should taste test as you go along. If possible, pop your mixing bowl into the fridge for an hour to let the flavors marry.",
      "Serve of the Curry Chicken Salad on top of salad greens, no dressing necessary."
    ],
    "image": "Low-Carb-Curry-Chicken-Salad-650378.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/RSNP5GR2/low-carb-curry-chicken-salad"
  },
  {
    "id": 645722,
    "title": "Grilled Ginger Miso Chicken",
    "ingredients": [
      "5 spice powder",
      "garlic clove",
      "ginger root",
      "green onions",
      "light soy sauce",
      "mirin",
      "light miso",
      "sake",
      "bone in skin on chicken thighs"
    ],
    "steps": [
      "Blend soy sauce, sake, mirin, miso, green onions, ginger root and garlic in a rectangular baking dish. Coat chicken with mixture. Marinate 1 hour or refrigerate overnight, turning several times.Preheat a hibachi, portable tabletop grill or charcoal grill. Shake marinade off chicken; pat dry.",
      "Place skin-down on hot grill. Grill 4 to 5 minutes. Turn chicken; grill second side 4 to 5 minutes or until golden brown and done inside. When chicken is done, sprinkle with sesame seeds and spice mixture.This recipe yields 4 servings.Comments: Miso marinade adds a rich flavor to this country-style grilled chicken. Thigh meat stays moist and tender, but boned chicken breasts are delicious, too. The chicken can be sauteed in a skillet."
    ],
    "image": "Grilled-Ginger-Miso-Chicken-645722.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/ZHYSF2NB/grilled-miso-chicken"
  },
  {
    "id": 650239,
    "title": "Loaded Veggie Omelet",
    "ingredients": [
      "shallot",
      "garlic",
      "mushrooms",
      "cherry tomatoes",
      "fresh basil",
      "fresh spinach",
      "eggs",
      "white cheese",
      "olive oil"
    ],
    "steps": [
      "Preheat the oven to warm or 170 degrees. Bring a small saute pan or small omelet pan to a warm.",
      "Saute the veggies using the olive oil starting with the shallot and garlic, adding the mushrooms until they are tender. Toss in the tomatoes and spinach and remove the pan from the heat.",
      "Pour a layer of the egg into a small omelet pan or small saute pan. As the egg starts to cook run a spatula around the edge to loosen the egg. Once the egg is almost cooked (slightly runny on the top) sprinkle half the basil, cheese, and sauteed veggies on to one side of the egg. Gently fold the egg over the filling.",
      "Slide the omelet onto a small oven safe plate and put it in the oven.",
      "Repeat for the second omelet!"
    ],
    "image": "Loaded-Veggie-Omelet-650239.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/MTFXZNRX/loaded-veggie-omelet"
  },
  {
    "id": 633541,
    "title": "Baked Chicken With Lemon & Garlic",
    "ingredients": [
      "chicken pieces",
      "garlic",
      "lemon (juice)",
      "olive oil",
      "parsley",
      "seasoned breadcrumbs"
    ],
    "steps": [
      "Preheat Oven 350 degrees:In a bowl mix the breadcrumbs, parsley, garlic, lemon juice and drizzles of olive oil and toss.",
      "Place the chicken pieces in a baking dish and drizzle a little olive oil over the chicken. Top the chicken pieces with the breadcrumb mixture and drizzle a little more olive oil.",
      "Place the chicken in the oven and bake for about 45  50 minutes or until the chicken is a beautiful golden color."
    ],
    "image": "Baked-Chicken-With-Lemon---Garlic-633541.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/JXQ88C5Q/baked-chicken-with-lemon-garlic"
  },
  {
    "id": 662100,
    "title": "Stuffed Tofu With Pork",
    "ingredients": [
      "carrots",
      "corn flour",
      "courgette",
      "garlic",
      "white ground pepper",
      "ground pork",
      "oil",
      "oyster sauce",
      "sesame oil",
      "soya sauce",
      "tofu",
      "water"
    ],
    "steps": [
      "Cut tofu into equal triangles. Using a knife, carefully cut around the edges of the long side of triangle. Make the incision slightly more than half way through the tofu. Make sure you dont cut through.Use a teaspoon to remove the tofu from the middle of each triangle. Be very careful to keep the pouch intact. Set aside the tofu that is take out from the middle. In small bowl, mix minced pork, tofu crumb, oyster sauce, soya sauce, white pepper, sesame oil, and corn flour.With a teaspoon, scoop the filling and stuff in to the middle part of the tofu as much as you could fit in. Shape the stuffing with your hands. Repeat this to the rest of the tofu pieces.",
      "Heat up a pan with oil enough to pan fry, pan fry each side of the tofu until golden brown. It takes about 15- 20 minutes to brown each piece of tofu and cook through the stuffing. Once all cooked, set tofu aside.Use back the same pan, drizzle some oil, put in the chopped garlic and cook until fragrant and slightly brown. Then, put in carrots and courgette/zucchini.",
      "Add in the sauce and cook until tender.",
      "Add in more water if necessary.",
      "Add back the cooked tofu to warm up. Coat tofu with the sauce.",
      "Sprinkle some chili flakes if you wish.",
      "Serve warm."
    ],
    "image": "Stuffed-Tofu-With-Pork-662100.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/JBKYXSTZ/stuffed-tofu-with-pork"
  },
  {
    "id": 639620,
    "title": "Classic New England Crab Cakes",
    "ingredients": [
      "onion",
      "celery",
      "unsalted butter",
      "lump crab meat",
      "dry bread crumbs",
      "mayonnaise",
      "seafood seasoning",
      "worcestershire sauce",
      "hot sauce",
      "parsley"
    ],
    "steps": [
      "Cook onion and celery in 4 tablespoons butter over moderately low heat, until tender and transfer to a bowl. Stir in crab and bread crumbs.",
      "In a small bowl whisk together mayonnaise, seafood seasoning, Worcestershire sauce, hot sauce, parsley, and salt and pepper to taste and stir into crab mixture until combined well.",
      "Line a baking sheet with wax paper. Form crab mixture into 6 flattened rounds. Chill crab cakes, covered with plastic wrap, at least 1 hour.",
      "Heat 1 tablespoon butter over moderate heat until foam subsides and cook half of crab cakes until golden brown, about 2 to 3 minutes on each side. Cook remaining cakes in remaining tablespoon butter in same manner."
    ],
    "image": "Classic-New-England-Crab-Cakes-639620.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/BC488L24/classic-new-england-crab-cakes"
  },
  {
    "id": 635032,
    "title": "Bitter Gourd Boiled With Pork Ribs (Ma-Ra Tom Ka-Dook Mou)",
    "ingredients": [
      "bitter gourd",
      "pork ribs",
      "greens",
      "fish sauce",
      "soy sauce",
      "water"
    ],
    "steps": [
      "Wash the gourd, cut in half length wise, remove and discard the seeds, and cut the flesh into 1\" x 2\" pieces.",
      "Boil the bones in the water, skimming off the scum as it forms. After a while, add the bitter gourd and fish sauce, and put the lid on the pot. Do not stir.",
      "Continue cooking until the gourd is well done, and then turn off the heat.",
      "Sprinkle with the coriander greens and serve hot."
    ],
    "image": "Bitter-Gourd-Boiled-With-Pork-Ribs-(Ma-Ra-Tom-Ka-Dook-Mou)-635032.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/QGMR3YCQ/bitter-gourd-boiled-with-pork-ribs-ma-ra-tom-ka-dook-mou"
  },
  {
    "id": 661556,
    "title": "Steamed Chicken With Soy-Ginger Sauce",
    "ingredients": [
      "chicken",
      "garlic",
      "ginger",
      "trimmed green onions",
      "ground ginger",
      "white ground pepper",
      "iceberg lettuce",
      "salt",
      "sesame oil",
      "soy sauce",
      "vegetable oil"
    ],
    "steps": [
      "Arrange the chicken halves skin side up and side by side in a glass pie plate.  Rub the skin with the soy sauce.",
      "Let stand for 15 minutes.Prepare a steamer and heat over high heat.",
      "Place the pie plate in the steaming basket, cover, and steam over high heat until the chicken is no longer pink near the bone, about 30 minutes.Meanwhile, make the sauce:  stir the grated ginger, green onions, sesame oil, soy sauce, garlic, ground ginger, salt, and pepper in a small heatproof bowl.",
      "Heat the vegetable oil in a small skillet just until it begins to smoke.  Carefully pour the hot oil into the ginger-soy mixture (the mixture may sizzle).  Stir well and let stand until cool.",
      "Remove the plate of chicken from the steamer and let cool slightly.Strip the meat from the bones and cut the meat into bite-sized pieces.",
      "Place on a serving platter with the lettuce cups alongside."
    ],
    "image": "Steamed-Chicken-With-Soy-Ginger-Sauce-661556.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/LHNPVH5S/steamed-chicken-with-soy-ginger-sauce"
  },
  {
    "id": 663905,
    "title": "Tuna and Tofu Cold Dish",
    "ingredients": [
      "silken tofu",
      "canned water-packed tuna",
      "white diced cherry tomatoes",
      "white pepper",
      "bbq sauce",
      "extra virgin olive oil",
      "vinegar",
      "light soya sauce",
      "garlic",
      "black pepper"
    ],
    "steps": [
      "Cut tofu into small blocks.",
      "Remove water from tuna and squash tuna slightly and mix with a dash of white pepper and pinch of salt. Slice cherry tomatoes thinly.",
      "Place tofu on serving plate with sliced cherry tomatoes and tuna on top.",
      "Drizzle the sauce over it and sprinkle with toasted sesame seeds and diced spring onion and serve immediately."
    ],
    "image": "Tuna-and-Tofu-Cold-Dish-663905.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/BJ66GGBY/tuna-and-tofu-cold-dish"
  },
  {
    "id": 631750,
    "title": "Flank Steak with Mushroom Sauce",
    "ingredients": [
      "beef broth",
      "butter",
      "flank steak",
      "fresh rosemary leaves",
      "garlic",
      "mushrooms",
      "olive oil",
      "diced shallot",
      "water"
    ],
    "steps": [
      "Heat 1 tablespoon oil in a 10-inch skillet over medium heat.",
      "Add the beef and cook until well browned on both sides and until desired doneness, about 10 minutes for medium-rare.",
      "Remove the beef from the skillet.",
      "Heat 1 tablespoon butter and the remaining oil in the skillet.",
      "Add the mushrooms and cook for 5 minutes or until tender, stirring occasionally.",
      "Add the shallot, garlic and rosemary and cook and stir for 30 seconds.   Stir in the concentrated broth, water and remaining butter and cook until the butter is melted.",
      "Cut the beef diagonally against the grain into thin slices.",
      "Serve the mushroom mixture with the beef."
    ],
    "image": "Flank-Steak-with-Mushroom-Sauce-631750.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/F4D23G25/flank-steak-with-mushroom-sauce"
  },
  {
    "id": 638550,
    "title": "Chili Chicken Salad",
    "ingredients": [
      "almonds",
      "celery",
      "chicken breasts",
      "chili powder",
      "mayo",
      "paprika",
      "red grapes",
      "salt"
    ],
    "steps": [
      "Wash Chicken breasts.",
      "Cut into cubes.Bring chicken to a boil.Chop celery.",
      "Add to bowl.",
      "Cut grapes in 4s.",
      "Add to bowl.",
      "Add sliced almonds to bowl.Once chicken is cooked through, remove from water.",
      "Add to food processor.",
      "Add chicken to bowl.",
      "Add chili powder.",
      "Mix thoroughly.",
      "Add paprika.",
      "Mix thoroughly.",
      "Add 1 cup mayo to mixture. Continue to add mayo until the consistency is to your liking.Salt to taste."
    ],
    "image": "Chili-Chicken-Salad-638550.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/32TFG87M/chili-chicken-salad"
  },
  {
    "id": 644761,
    "title": "Glazed pork chops",
    "ingredients": [
      "balsamic vinegar",
      "black pepper",
      "butter",
      "cornstarch",
      "garlic cloves",
      "fresh green onions",
      "honey",
      "lean boneless pork chops",
      "soy sauce"
    ],
    "steps": [
      "Press one side of each chop into the black pepper.",
      "Heat nonstick grill skillet until hot.",
      "Add pork chops, pepper side down, and cook about 4 minutes or until browned.Reduce heat to medium, turn pork chops and cook 6-8 minutes longer.When done, take the skillet from the heat, cover the pork chops and set aside.Meanwhile, mix honey, soy sauce, balsamic vinegar and cornstarch until smooth.",
      "Add the cracked pepper, stir.Melt the butter in a small pan, add garlic and cook for 30 seconds, stirring.Stir honey mixture into pan, let it boil, cook for 1 minute, stirring.Spoon sauce over pork chops, sprinkle with fresh chives or green onions.",
      "Serve with polenta and green salad."
    ],
    "image": "Glazed-pork-chops-644761.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/HZVLJQMT/glazed-pork-chops"
  },
  {
    "id": 659596,
    "title": "Scrambled Egg-Stuffed Poblano Chiles With Spicy Cheese Sauce",
    "ingredients": [
      "poblano chiles",
      "eggs",
      "half n half",
      "shredded jack cheese",
      "white shredded extra sharp cheddar cheese",
      "salt and pepper"
    ],
    "steps": [
      "First roast the chiles and remove the skins.",
      "Make a slit in the poblanos and remove the seeds. Keep the chiles warm in a 200 degree oven.",
      "Scramble your eggs however you like them best.",
      "Meanwhile, on very low heat, melt the cheese, stirring constantly, along with a little bit of half and half (you could use milk, but not too much because you don't want to make the sauce too thin).",
      "Now just fill each poblano with egg and top with the cheese sauce."
    ],
    "image": "Scrambled-Egg-Stuffed-Poblano-Chiles-With-Spicy-Cheese-Sauce-659596.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/ZKBJD2JC/scrambled-egg-stuffed-poblano-chiles-with-spicy-cheese-sauce"
  },
  {
    "id": 639320,
    "title": "Chorizo and egg bake",
    "ingredients": [
      "low fat cheddar cheese",
      "smoked chorizo sausage",
      "eggs",
      "garlic",
      "onion",
      "canned green red chilli",
      "salt and pepper"
    ],
    "steps": [
      "Preheat the oven to 170 CIn a bowl, whisk the eggs, add the grated cheese, onion, chorizo, garlic and chopped chilli. Season with salt and pepper.",
      "Transfer to a lightly greased baking dish and bake for 20 minutes."
    ],
    "image": "Chorizo-and-egg-bake-639320.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/58RHVHVF/chorizo-and-egg-bake"
  },
  {
    "id": 656856,
    "title": "Pork, Porcini, Pancetta Meatloaf",
    "ingredients": [
      "dried porcini mushrooms",
      "diced pancetta",
      "shredded carrot",
      "shredded leek",
      "garlic",
      "ground pork",
      "parmesan cheese",
      "eggs",
      "fennel seed",
      "ground sage",
      "salt",
      "black pepper"
    ],
    "steps": [
      "Rehydrate porcini mushrooms in hot water until soft; squeeze moisture out and chop, reserving mushroom liquid.",
      "Heat a large skillet over medium high heat and cook diced pancetta until crisp.",
      "Remove to a bowl with a slotted spoon, reserving drippings.",
      "Add carrots, leeks (onions) and garlic to the pan and cook until soft, about 5 minutes.",
      "Add reserved mushroom liquid and continue cooking over medium low until all moisture has been absorbed.",
      "Combine vegetables and reserved pancetta bits with bread crumbs, cheese, eggs, and spices and mix well.",
      "Add meat and use a fork to combine fully, making sure not to pack down the meat too much.",
      "Press meat into an 8 x 8 baking dish and bake at 350 degrees until cooked through, about 40 minutes."
    ],
    "image": "Pork--Porcini--Pancetta-Meatloaf-656856.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/XLKPS6JP/pork-porcini-pancetta-meatloaf"
  },
  {
    "id": 632925,
    "title": "Asparagus and Asiago Frittata",
    "ingredients": [
      "eggs",
      "trimmed asparagus",
      "butter",
      "olive oil",
      "heavy whipping cream",
      "fresh thyme",
      "garlic clove",
      "salt",
      "black ground pepper",
      "asiago cheese",
      "cherry tomatoes"
    ],
    "steps": [
      "In a large bowl, combine the eggs, whipping cream, salt, pepper, and half the fresh thyme. Beat with a whisk until the eggs and cream are incorporated.",
      "In an ovenproof saut pan over medium heat, add the butter and olive oil. When the mixture is hot, add the asparagus pieces and cook for 3-4 minutes, stirring.",
      "Add the garlic and cook for about a minute.",
      "Spread the asparagus so it is evenly distributed across the bottom of the pan.",
      "Add the egg mixture to the pan and allow the eggs to cook without mixing them. Use a rubber spatula to run around the edges of the frittata as it cooks so the edges dont stick and burn. After 1-2 minutes, add the cheese evenly to the egg mixture.",
      "When the outer edges of the frittata have set but the center is still slightly runny, arrange the cherry tomatoes and asparagus spears on the top of the frittata, sprinkle the remaining thyme over the top, then remove the pan from the heat and place it in an oven set to broil.",
      "The broiler will allow the top portion of the egg mixture to set and cook thoroughly. Keep a close watch so the frittata doesnt burn.",
      "After a few minutes, when the eggs have set completely and begin to turn golden, carefully remove the pan from the oven.",
      "Use a rubber spatula to run around the edges and underside of the frittata, and slide it onto a round serving plate.",
      "Slice and serve warm or at room temperature."
    ],
    "image": "Asparagus-and-Asiago-Frittata-632925.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/KYWTWPZT/asparagus-and-asiago-frittata"
  },
  {
    "id": 638534,
    "title": "Chile Relleno Casserole",
    "ingredients": [
      "cooked chicken",
      "poblano peppers",
      "eggs",
      "heavy cream",
      "salt",
      "queso fresco",
      "shredded cheddar cheese"
    ],
    "steps": [
      "Preheat the oven to 350 F.  Generously butter an 8 x 10 baking dish.",
      "Whisk the eggs, cream and salt together well in a medium-sized mixing bowl.",
      "Line the bottom of the baking dish with half of the poblano peppers, cut side up; top with the chicken and Queso Fresco.  Arrange the remaining poblano peppers over the top of the chicken and cheese, cut side down, and pour the egg/cream mixture evenly over the entire dish.  Top with the shredded cheddar cheese.",
      "Bake for 35  45 minutes, or until a knife in inserted in the center comes out clean and the top is golden brown.  Allow to rest for 5  7 minutes before serving."
    ],
    "image": "Chile-Relleno-Casserole-638534.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/ZJWJYY7Z/chile-relleno-casserole"
  },
  {
    "id": 633068,
    "title": "Authentic Bolognese Sauce",
    "ingredients": [
      "carrot",
      "celery",
      "dry white wine",
      "garlic cloves",
      "ground beef",
      "olive oil",
      "diced onion",
      "pancetta",
      "pepper",
      "salt",
      "tomato paste",
      "whole milk"
    ],
    "steps": [
      "In a large skillet, heat oil over medium heat. Cook pancetta, onion, carrot, celery, and garlic until soft, about 10-15 minutes.",
      "Add ground beef and cook until no longer pink. Stir in wine, milk, and tomato paste.",
      "Add salt and pepper.Simmer uncovered for 1 hour, until most of the liquid is absorbed."
    ],
    "image": "Authentic-Bolognese-Sauce-633068.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/TV5C22MQ/authentic-bolognese-sauce"
  },
  {
    "id": 1003670,
    "title": "Stuffed Chicken Breast",
    "ingredients": [
      "chicken seasoning",
      "cream cheese",
      "green onions",
      "skinless boneless chicken breast"
    ],
    "steps": [
      "Wash and Pat dry chicken breast.",
      "Cut chicken lengthwise, careful not to cut all the way through.",
      "Stuff chicken breast with cream cheese and onion.",
      "Firmly press the chicken breast closed.",
      "Spray chicken with olive oil based cooking spray.",
      "Rib chicken breast with your favorite chicken seasonings."
    ],
    "image": "stuffed-chicken-breast-1003670.jpg",
    "sourceUrl": "https://www.pinkwhen.com/stuffed-chicken-breast/"
  },
  {
    "id": 643514,
    "title": "Fresh Herb Omelette",
    "ingredients": [
      "eggs",
      "black pepper",
      "green onion",
      "cherry tomatoes",
      "fresh basil",
      "shredded parmesan cheese",
      "olive oil"
    ],
    "steps": [
      "Stir your eggs together in a bowl with the pepper making sure to break the yolks.",
      "Heat a pan to medium-high and pour enough olive oil to cover the bottom of the pan.",
      "Pour your egg into the pan. Cook for 1-2 minutes or until the egg stops bubbling and begins to solidify.",
      "Flip the egg over and heat the other side until it is cooked through.",
      "Place on your plate.",
      "Add your toppings and enjoy!"
    ],
    "image": "Fresh-Herb-Omelette-643514.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/THWJHNSX/herb-fresh-omelette"
  },
  {
    "id": 640612,
    "title": "Creamy Cheesy Ham Tomato Sauce",
    "ingredients": [
      "chicken stock",
      "chardonnay",
      "sherry vinegar",
      "juniper berries",
      "rosemary",
      "diced shallots",
      "whole canned tomatoes",
      "heavy cream",
      "cooked whole ham",
      "fresh mozzarella",
      "fresh parmesan cheese"
    ],
    "steps": [
      "Preheat oven to 40",
      "Bring stock, wine, vinegar, berries, rosemary and shallots to a boil in a 9-10inch oven proof skillet over medium-high heat. Reduce until there is only about  cup left in the pan. Stir in the tomatoes and cook for 5 minutes. Stir in the cream, salt and pepper, simmer stirring occasionally until thickened 10-12 minutes. Arrange the slices of ham in the skillet  spreading them out over the skillet  add the chopped pieces of ham as well.",
      "Sprinkle the top with first parmesan and then mozzarella.",
      "Bake in the oven until the ham is heated through and the cheese is melted and bubbly  about 30 minutes.",
      "Serve immediately over fresh cooked pasta."
    ],
    "image": "Creamy-Cheesy-Ham-Tomato-Sauce-640612.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/DMY8KBB4/creamy-cheesy-ham-tomato-sauce"
  },
  {
    "id": 1062882,
    "title": "Easy Slow Cooker Whole Chicken With Rosemary",
    "ingredients": [
      "chicken",
      "extra-virgin olive oil",
      "lemons",
      "onion",
      "paprika",
      "pepper",
      "rosemary",
      "salt",
      "unsalted butter",
      "water"
    ],
    "steps": [
      "Combine all seasonings in a small bowl, reserving half of the rosemary. Baste the chicken with unsalted butter and olive oil and then cover with seasonings.",
      "Add half of the onion, lemons, and rosemary to the inner cavity of the chicken.",
      "Roll up three small lemon-sized balls of foil and place in the bottom of the slow cooker.",
      "Place half of lemons and onion with water into the bottom of the slow cooker.",
      "Add remaining rosemary to the top of the chicken.Cover and cook on low for 7-8 hours, or high for 4-5 hours."
    ],
    "image": "easy-slow-cooker-whole-chicken-with-rosemary-1062882.jpg",
    "sourceUrl": "https://www.pinkwhen.com/slow-cooker-rosemary-whole-chicken/"
  },
  {
    "id": 654241,
    "title": "Oven-Baked Feta Cheese Dip",
    "ingredients": [
      "feta cheese",
      "garlic",
      "tomato sauce",
      "shredded part-skim mozzarella cheese",
      "shredded mild cheddar cheese"
    ],
    "steps": [
      "Preheat oven at 40",
      "In a small oven-safe baking dish, or a clay pot, layer the crumbled cheese, covering the entire bottom of the dish.",
      "Sprinkle the minced garlic on top of the feta cheese.",
      "Spoon the tomato sauce, covering the entire cheese and garlic mixture.",
      "Mix together the mozzarella cheese and the cheddar cheese; layer on top of the tomato sauce.",
      "Bake it in the oven for 15 minutes, or until the cheese is melted.",
      "Serve it warm with a side of flatbread or tortilla chips."
    ],
    "image": "Oven-Baked-Feta-Cheese-Dip-654241.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/5KMXH3D3/oven-baked-feta-cheese-dip"
  },
  {
    "id": 665734,
    "title": "Zucchini Chicken Omelette",
    "ingredients": [
      "eggs",
      "water",
      "zucchini",
      "salt and pepper",
      "oil",
      "diced chicken"
    ],
    "steps": [
      "Beat eggs and water in a bowl.",
      "Mix in grated zucchini and season with salt and pepper.",
      "Heat the oil in a small, non-stick skillet. When hot, add half the egg mixture and cook for 1 minute until the egg begins to set. Scatter evenly with half diced chicken.",
      "Cook for a further 1-2 minutes, until the egg is golden underneath, and just set on top. Slide out onto a serving plate, folding it over as you go. Repeat.",
      "Serve the omelette with your favourite salad."
    ],
    "image": "Zucchini-Chicken-Omelette-665734.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/TPJ6QNBY/zucchini-chicken-omelette"
  },
  {
    "id": 662276,
    "title": "Sun Dried Tomato and Herb Baked Eggs",
    "ingredients": [
      "eggs",
      "fresh basil",
      "fresh parsley",
      "olive oil",
      "sundried tomatoes"
    ],
    "steps": [
      "Preheat oven to 350 F.Cover the inside of one ramekin or oven safe dish with olive oil.Line the bottom of the dish with sundried tomatoes and break two eggs on top.",
      "Sprinkle with fresh herbs.",
      "Bake uncovered for 15-20 minutes until egg whites are firm.",
      "Serve immediately."
    ],
    "image": "Sun-Dried-Tomato-and-Herb-Baked-Eggs-662276.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/V4LG5KBB/sundried-tomato-and-herb-baked-eggs"
  },
  {
    "id": 663680,
    "title": "Torta (Filipino Omelet)",
    "ingredients": [
      "low fat diced ground beef",
      "garlic cloves",
      "diced onion",
      "canned diced tomatoes",
      "eggs",
      "scallions",
      "cilantro",
      "vegetable oil",
      "low sodium soy sauce",
      "Salt & Pepper"
    ],
    "steps": [
      "In a medium-heated large skillet, add a little oil and thoroughly cook the meat and potatoes along with soy sauce, garlic and onions. Set aside to cool.",
      "Meanwhile, in a mixing bowl, combine cooled meat mixture with the eggs, tomatoes, cilantro and scallions. Season with salt & pepper and whisk until evenly incorporated.",
      "In the same skillet in medium heat, ladle just enough to form a thin pancake-size patty, one batch at a time. Cook both sides, flipping over after 2-3 minutes. Be careful not to over brown the eggs.",
      "Transfer to a plate, cut in wedges (for bite-size servings) and garnish with cilantro leaves, if you want."
    ],
    "image": "Torta-(Filipino-Omelet)-663680.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/DFP52247/torta-filipino-omelet"
  },
  {
    "id": 633697,
    "title": "Baked paneer in pumpkin sauce",
    "ingredients": [
      "paneer",
      "pumpkin puree",
      "salt",
      "chili powder",
      "garlic paste",
      "ginger paste",
      "lemon juice"
    ],
    "steps": [
      "Preheat oven at 375 degree Fahrenheit. Prepare a cookie sheet with a parchment paper and lightly grease it with cooking spray.",
      "Cut Paneer into slightly thick triangles and keep it aside.",
      "In a bowl combine rest of the ingredients.",
      "Add Paneer to the pumpkin mix and mix gently.",
      "Let it marinate for 15 minutes.",
      "Transfer the Paneer pieces to the prepared cookie sheet and put it in the middle rack of the oven.",
      "Bake it for 30 minutes.",
      "Take it out, garnish with some cilantro and serve hot."
    ],
    "image": "Baked-paneer-in-pumpkin-sauce-633697.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/B8Z7M788/baked-paneer-in-pumpkin-sauce"
  },
  {
    "id": 633224,
    "title": "Baby Brie-Topped Potato Slices",
    "ingredients": [
      "brie cheese",
      "fresh rosemary leaves",
      "olive oil",
      "parmesan cheese",
      "red potatoes",
      "sundried tomatoes"
    ],
    "steps": [
      "Heat oven to broil.",
      "Cut small slice off ends of each potato.",
      "Cut each potato into 6 slices, about  inch thick.",
      "Place on broiler pan.",
      "Brush with olive oil.Broil 4 inches from heat 6 to 7 minutes or until well browned; turn.",
      "Brush with olive oil and sprinkle with Parmesan cheese. Broil 3 to 4 minutes or until browned and tender.",
      "Remove from oven and turn oven off. Top each slice with a wedge of Alouette Baby Brie and 1 or 2 strips of sundried tomato.Put back into warm oven (without turning it on) for another 5 minutes allowing cheese to soften.",
      "Remove from oven, sprinkle with rosemary and serve."
    ],
    "image": "Baby-Brie-Topped-Potato-Slices-633224.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/SRSZC2Z3/baby-brie-topped-potato-slices"
  },
  {
    "id": 651996,
    "title": "Miniature Vegetable Quiches",
    "ingredients": [
      "asparagus tips",
      "diced bell peppers",
      "cream cheese",
      "dill",
      "eggs",
      "extra virgin olive oil",
      "half and half",
      "frozen peas",
      "pepper",
      "salt",
      "shallots",
      "tea",
      "green tea",
      "water"
    ],
    "steps": [
      "Place tea bags in a 2-cup glass measure.",
      "Add water.  Steep tea for 10 minutes.Squeeze all liquid from tea bags into cup.  Discard tea bags.  (About  cup tea concentrate.)",
      "Heat oven to 350 F.  Spray 2 (12-cup) muffin tins with baking spray (spray well or alternatively use paper liners); set aside.In 10-inch non-stick skillet place olive oil.",
      "Heat for 1 minute.",
      "Add peppers, asparagus, peas, and shallots. Cook over medium high heat, stirring occasionally, until slightly softened.",
      "Add  cup tea concentrate to vegetable mixture.  Continue cooking, stirring occasionally, until most of the tea is evaporated.",
      "Remove from heat; set aside.In large bowl stir together eggs, half and half, salt and pepper.",
      "Mix well.In bottom of each prepared mini muffin tin, place about 1 tablespoon vegetable mixture.  Top with piece of cream cheese.  Fill to top with egg mixture.Repeat with remaining ingredients.",
      "Bake for 15 to 18 minutes or until very lightly browned near edges.",
      "Remove from oven.  Cool slightly.",
      "Garnish with dill if desired."
    ],
    "image": "Miniature-Vegetable-Quiches-651996.jpg",
    "sourceUrl": "http://www.foodista.com/recipe/YZPYZDM5/miniature-vegetable-quiches"
  },
  {
    "id": 665344,
    "title": "Wild Rice With Bacon, Mushrooms & Green Onions",
    "ingredients": [
      "wild rice",
      "fresh button mushrooms",
      "butter",
      "real bacon bits",
      "green onions"
    ],
    "steps": [
      "In a large sauce pot, saut mushrooms in butter until golden brown.",
      "Add bacon and 1/2 of the green onions and saute just 1 minute.",
      "Add all of the water that the box mix calls for.",
      "Combine wild rice mix into the water and follow box instructions.",
      "When rice is done, stir in remaining green onions and serve immediately."
    ],
    "image": "Wild-Rice-With-Bacon--Mushrooms---Green-Onions-665344.jpg",
    "sourceUrl": "https://www.foodista.com/recipe/H4TVGTQM/wild-rice-with-bacon-mushrooms-green-onions"
  }
]
